English/NewWords/NewWords03.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<title></title>
<!-- 2013-06-11 二 10:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="author" content="visayafan"/>
</head>
<body>
<div id="preamble" class="status">
<div id="org-div-comments"><a href="../../index.html#english">主页</a></div>
</div>
<div id="content">
<h1 class="title"></h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. crush/flattered</a></li>
<li><a href="#sec-2">2. horde</a></li>
<li><a href="#sec-3">3. sprain</a></li>
<li><a href="#sec-4">4. euphemism</a></li>
<li><a href="#sec-5">5. sanitizer/armpit/intensify/stench/vaguely</a></li>
<li><a href="#sec-6">6. ignition/retrieve</a></li>
<li><a href="#sec-7">7. constipation</a></li>
<li><a href="#sec-8">8. snuck</a></li>
<li><a href="#sec-9">9. bigot</a></li>
<li><a href="#sec-10">10. dogma</a></li>
<li><a href="#sec-11">11. I don't know you from Adam.</a></li>
<li><a href="#sec-12">12. mellow</a></li>
<li><a href="#sec-13">13. enclosure</a></li>
<li><a href="#sec-14">14. attest</a></li>
<li><a href="#sec-15">15. penisula</a></li>
<li><a href="#sec-16">16. -logue</a></li>
<li><a href="#sec-17">17. inebriated</a>
<ul>
<li><a href="#sec-17-1">17.1. inebriate</a></li>
</ul>
</li>
<li><a href="#sec-18">18. retarded</a>
<ul>
<li><a href="#sec-18-1">18.1. retard</a></li>
</ul>
</li>
<li><a href="#sec-19">19. striptease</a>
<ul>
<li><a href="#sec-19-1">19.1. strip</a></li>
<li><a href="#sec-19-2">19.2. tease</a></li>
</ul>
</li>
<li><a href="#sec-20">20. ham</a></li>
<li><a href="#sec-21">21. SWAT</a></li>
<li><a href="#sec-22">22. pervert</a></li>
<li><a href="#sec-23">23. brunette</a></li>
<li><a href="#sec-24">24. arrogant</a></li>
<li><a href="#sec-25">25. resort to</a></li>
<li><a href="#sec-26">26. derail</a></li>
<li><a href="#sec-27">27. persecute</a></li>
<li><a href="#sec-28">28. refute</a></li>
<li><a href="#sec-29">29. rebuke</a></li>
<li><a href="#sec-30">30. crackpot</a></li>
<li><a href="#sec-31">31. elaborate</a></li>
<li><a href="#sec-32">32. pedestrian</a></li>
<li><a href="#sec-33">33. pessimism</a></li>
<li><a href="#sec-34">34. penetrate</a></li>
<li><a href="#sec-35">35. mourn</a></li>
<li><a href="#sec-36">36. allegedly</a></li>
<li><a href="#sec-37">37. sublease</a></li>
<li><a href="#sec-38">38. almighty</a></li>
<li><a href="#sec-39">39. hot-button</a></li>
<li><a href="#sec-40">40. hothead</a></li>
<li><a href="#sec-41">41. splutter</a></li>
<li><a href="#sec-42">42. What's the buzz?</a></li>
<li><a href="#sec-43">43. cease and desist</a></li>
<li><a href="#sec-44">44. obnoxious</a></li>
<li><a href="#sec-45">45. hooray</a></li>
<li><a href="#sec-46">46. chore</a></li>
<li><a href="#sec-47">47. credential</a></li>
<li><a href="#sec-48">48. caveat</a></li>
</ul>
</div>
</div>
<!-- <script type="text/javascript" src="https://ajax.googleapis.com/ajax/libs/jquery/1.7.1/jquery.min.js"> </script> -->
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/bootstrap_old.css" />
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/too_many_toc.css" />
<script src="../../Layout/JS/jquery_1.7.1.js"></script>
<script src="../../Layout/JS/bootstrap_old.js"></script>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> crush/flattered</h2>
<div class="outline-text-2" id="text-1">
<p>
crush 暗恋的人<br/>
flatter奉承，谄媚-&gt;flattered 高兴的，感到荣幸的<br/>
</p>
<pre class="example">
Today, my crush asked to use my phone so he could Google something. Flattered that he wanted to use my phone, I agreed. After he was done, he handed it back with a weird look. I later realized he had found himself in my top searches. FML
</pre>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> horde</h2>
<div class="outline-text-2" id="text-2">
<p>
a horde of 一大群<br/>
</p>
<pre class="example">
Today, the iPhone app I downloaded that plays cricket noises during the night, has attracted a horde of actual crickets into my bedroom. FML
</pre>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> sprain</h2>
<div class="outline-text-2" id="text-3">
<p>
sprain 扭伤 sprain ankle扭伤脚踝<br/>
</p>
<pre class="example">
Today, I sprained my ankle trying to prove that I can walk in high heels. FML
</pre>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> euphemism</h2>
<div class="outline-text-2" id="text-4">
<p>
euphemism 委婉语<br/>
euphemistic=euphemious 委婉的 euphemize 委婉地说<br/>
</p>
<pre class="example">
Today, my boyfriend invited me over to "play with his lizard." After excitedly rushing across town, I realized this wasn't a euphemism, he actually bought an Iguana. FML
</pre>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> sanitizer/armpit/intensify/stench/vaguely</h2>
<div class="outline-text-2" id="text-5">
<p>
sanitize 对&#x2026;进行消毒杀菌-&gt;sanitizer 食品防腐剂；消毒杀菌剂-&gt;hand sanitizer洗手液<br/>
armpit 腋下 -&gt;armpit odor<br/>
intense 紧张的，密集的-&gt;intensify 增加，加剧，强化<br/>
stench 恶臭 stink 臭味 stinking 臭的<br/>
vague 模糊的，含糊的 vaguely<br/>
</p>
<pre class="example">
Today, I decided to use hand sanitizer to mask the smell of my armpits at work. Not only did it intensify the stench, my boss thinks I have a drinking problem, because I vaguely smelled of alcohol. I was too embarrassed to explain. FML
</pre>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> ignition/retrieve</h2>
<div class="outline-text-2" id="text-6">
<p>
ignite 点燃，点火-&gt;ignition 点火装置 ignition key 点火钥匙（汽车术语）<br/>
retrieve 取回<br/>
</p>
<pre class="example">
Today, while I was leaving the grocery store, I realized my ignition key was missing from my pocket. After searching the car and retracing my steps, I walked all the way home. Later, when we went to retrieve the car, the key was sitting in plain sight on the passenger seat. FML
</pre>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> constipation</h2>
<div class="outline-text-2" id="text-7">
<p>
constipate (v)便秘，呆滞 -&gt; constipation (n)便秘<br/>
</p>
<pre class="example">
Today, while having sex with my girlfriend in the bathroom, we heard a knock at the door, then her father's voice. I had to fake constipation noises until he left. FML
</pre>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> snuck</h2>
<div class="outline-text-2" id="text-8">
<p>
sneak 偷偷地做，溜； -&gt;snuck 过去式<br/>
</p>
<pre class="example">
Today, I snuck out to go see my girlfriend. When I got to her house, I left my bike out front and we went on a nice walk around the block. We passed a homeless-looking woman going the opposite way. About ten minutes later, the same woman passed us, on my bike. FML
</pre>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> bigot</h2>
<div class="outline-text-2" id="text-9">
<p>
bigot 顽固的人，偏执的人-&gt;bigoted 顽固的 -&gt;bigotry 顽固<br/>
</p>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> dogma</h2>
<div class="outline-text-2" id="text-10">
<p>
n 教义/教条<br/>
dogmatic 教条的，武断的，傲慢专断的－&gt;dogmatist教条主义者<br/>
doctrine 教条/教义/主义<br/>
</p>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> I don't know you from Adam.</h2>
<div class="outline-text-2" id="text-11">
<p>
我不认识你。<br/>
</p>
</div>
</div>

<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> mellow</h2>
<div class="outline-text-2" id="text-12">
<p>
mellow 成熟的/圆润的/柔和的 | 使成熟<br/>
</p>
<pre class="example">
In general, Tommy is a very shy orangutan. But since the iPad has been introduced, his behavior has mellowed in a way and he has gotten more accustomed to being near people.
</pre>
</div>
</div>

<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> enclosure</h2>
<div class="outline-text-2" id="text-13">
<p>
enclosure 附件/围墙/笼子<br/>
</p>
<pre class="example">
But he would watch from the back of his enclosure as the zoo keepers worked with the other orangutans.
</pre>
</div>
</div>

<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> attest</h2>
<div class="outline-text-2" id="text-14">
<p>
provide or serve as a clear evidence 证明/表明<br/>
attest (to) sth 证明了某件事<br/>
</p>
<pre class="example">
His numerous drawings of babies attest to his fascination with them.
His handling of the crisis attested to his strength of character.
Her outstanding abilities were attested by her rapid promotion.
</pre>
</div>
</div>

<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> penisula</h2>
<div class="outline-text-2" id="text-15">
<p>
半岛<br/>
</p>
<pre class="example">
Many are looking forward to calmer days on the Korean peninsula.
</pre>
</div>
</div>

<div id="outline-container-sec-16" class="outline-2">
<h2 id="sec-16"><span class="section-number-2">16</span> -logue</h2>
<div class="outline-text-2" id="text-16">
<p>
表谈话<br/>
dialogue 对话（两个人）<br/>
monologue 独白（一个人）<br/>
</p>
</div>
</div>

<div id="outline-container-sec-17" class="outline-2">
<h2 id="sec-17"><span class="section-number-2">17</span> inebriated</h2>
<div class="outline-text-2" id="text-17">
<p>
adj intoxicated/drunk<br/>
</p>
</div>
<div id="outline-container-sec-17-1" class="outline-3">
<h3 id="sec-17-1"><span class="section-number-3">17.1</span> inebriate</h3>
<div class="outline-text-3" id="text-17-1">
<p>
v make drunk/become drunk<br/>
=intoxicate<br/>
</p>
</div>
</div>
</div>

<div id="outline-container-sec-18" class="outline-2">
<h2 id="sec-18"><span class="section-number-2">18</span> retarded</h2>
<div class="outline-text-2" id="text-18">
<p>
limited or delayed in intellectual and/or emotional development, characterized by mental retardation<br/>
adj 智力迟钝的<br/>
mental retardation 智力迟钝<br/>
</p>
</div>
<div id="outline-container-sec-18-1" class="outline-3">
<h3 id="sec-18-1"><span class="section-number-3">18.1</span> retard</h3>
<div class="outline-text-3" id="text-18-1">
<p>
make sth slow or late/hinder 使放慢或阻碍<br/>
</p>
</div>
</div>
</div>

<div id="outline-container-sec-19" class="outline-2">
<h2 id="sec-19"><span class="section-number-2">19</span> striptease</h2>
<div class="outline-text-2" id="text-19">
<p>
脱衣舞<br/>
</p>
</div>
<div id="outline-container-sec-19-1" class="outline-3">
<h3 id="sec-19-1"><span class="section-number-3">19.1</span> strip</h3>
<div class="outline-text-3" id="text-19-1">
<p>
v take off clothes脱衣<br/>
</p>
</div>
</div>

<div id="outline-container-sec-19-2" class="outline-3">
<h3 id="sec-19-2"><span class="section-number-3">19.2</span> tease</h3>
<div class="outline-text-3" id="text-19-2">
<p>
n/v<br/>
</p>
<ol class="org-ol">
<li>make fun of 取笑<br/>
</li>
<li>tempt sexually 挑逗<br/>
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-20" class="outline-2">
<h2 id="sec-20"><span class="section-number-2">20</span> ham</h2>
<div class="outline-text-2" id="text-20">
<p>
火腿 a ham sandwich火腿三明治<br/>
</p>
</div>
</div>

<div id="outline-container-sec-21" class="outline-2">
<h2 id="sec-21"><span class="section-number-2">21</span> SWAT</h2>
<div class="outline-text-2" id="text-21">
<p>
Special Weapon And <a href="Amercia-TheStoryOfUs-WW2.html">Tactics</a> 特殊武器与战术.<br/>
拥有先进技术战术手段的反暴力、反恐怖特别执法单位。<br/>
</p>
</div>
</div>

<div id="outline-container-sec-22" class="outline-2">
<h2 id="sec-22"><span class="section-number-2">22</span> pervert</h2>
<div class="outline-text-2" id="text-22">
<p>
v 误用滥用/（人/心理）堕落/变坏<br/>
n 变态<br/>
</p>
</div>
</div>

<div id="outline-container-sec-23" class="outline-2">
<h2 id="sec-23"><span class="section-number-2">23</span> brunette</h2>
<div class="outline-text-2" id="text-23">
<p>
深色发肤的人<br/>
</p>
</div>
</div>

<div id="outline-container-sec-24" class="outline-2">
<h2 id="sec-24"><span class="section-number-2">24</span> arrogant</h2>
<div class="outline-text-2" id="text-24">
<p>
傲慢的<br/>
</p>
</div>
</div>

<div id="outline-container-sec-25" class="outline-2">
<h2 id="sec-25"><span class="section-number-2">25</span> resort to</h2>
<div class="outline-text-2" id="text-25">
<p>
make use of sth for help采取某种行动作为紧急措施<br/>
</p>
<pre class="example">
If negotiations fail we shall have to resort to strike action. 假若谈判失败, 我们就采取罢工行动.
</pre>
</div>
</div>

<div id="outline-container-sec-26" class="outline-2">
<h2 id="sec-26"><span class="section-number-2">26</span> derail</h2>
<div class="outline-text-2" id="text-26">
<p>
使火车/电车出轨；使事情偏离原来的方向<br/>
</p>
<pre class="example">
derailing the conversation into flaming matches
</pre>
</div>
</div>

<div id="outline-container-sec-27" class="outline-2">
<h2 id="sec-27"><span class="section-number-2">27</span> persecute</h2>
<div class="outline-text-2" id="text-27">
<p>
~ sb for sth因为信仰不同而对其加以迫害<br/>
</p>
<pre class="example">
the phrasing here is persecuting.
</pre>
</div>
</div>

<div id="outline-container-sec-28" class="outline-2">
<h2 id="sec-28"><span class="section-number-2">28</span> refute</h2>
<div class="outline-text-2" id="text-28">
<p>
反驳 prove to be wrong<br/>
</p>
<pre class="example">
refute a claim, a theory, an argument 驳斥某要求、理论、论点
</pre>
</div>
</div>

<div id="outline-container-sec-29" class="outline-2">
<h2 id="sec-29"><span class="section-number-2">29</span> rebuke</h2>
<div class="outline-text-2" id="text-29">
<p>
指责 express sharp or severe disapproval to sb, esp officially<br/>
rebuke sb for sth<br/>
</p>
<pre class="example">
My boss rebuked me for coming to work late. 我的上司指摘我上班迟到.
</pre>
</div>
</div>

<div id="outline-container-sec-30" class="outline-2">
<h2 id="sec-30"><span class="section-number-2">30</span> crackpot</h2>
<div class="outline-text-2" id="text-30">
<p>
crazy,nut,weirdo疯子/怪人<br/>
</p>
</div>
</div>

<div id="outline-container-sec-31" class="outline-2">
<h2 id="sec-31"><span class="section-number-2">31</span> elaborate</h2>
<div class="outline-text-2" id="text-31">
<p>
v Add more details concerning what has already been said 更详细地描述<br/>
adj 详细的/复杂的<br/>
</p>
</div>
</div>

<div id="outline-container-sec-32" class="outline-2">
<h2 id="sec-32"><span class="section-number-2">32</span> pedestrian</h2>
<div class="outline-text-2" id="text-32">
<p>
someone who travels on foot徒步旅行者<br/>
</p>
</div>
</div>

<div id="outline-container-sec-33" class="outline-2">
<h2 id="sec-33"><span class="section-number-2">33</span> pessimism</h2>
<div class="outline-text-2" id="text-33">
<p>
悲观<br/>
派生词：<br/>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="left"/>

<col class="left"/>
</colgroup>
<tbody>
<tr>
<td class="left">pessimistic</td>
<td class="left">悲观的</td>
</tr>

<tr>
<td class="left">pessimistically</td>
<td class="left">悲观地</td>
</tr>

<tr>
<td class="left">pessimist</td>
<td class="left">悲观主义者</td>
</tr>
</tbody>
</table>
<p>
反：optimism 乐观的<br/>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="left"/>

<col class="left"/>
</colgroup>
<tbody>
<tr>
<td class="left">optimistic</td>
<td class="left">adj</td>
</tr>

<tr>
<td class="left">optimist</td>
<td class="left">乐观主义者</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-34" class="outline-2">
<h2 id="sec-34"><span class="section-number-2">34</span> penetrate</h2>
<div class="outline-text-2" id="text-34">
<p>
v 插入、渗入、遍布、洞察/发现、被（他人）理解领悟（to be fully understood by sb.）<br/>
</p>
<pre class="example">
The heavey rain had penetrated right through his coat.
He penetrated their thoughts.
I explained the problem to him several times but it didn't seem to penerate.
</pre>
<p>
penetration n<br/>
</p>
</div>
</div>

<div id="outline-container-sec-35" class="outline-2">
<h2 id="sec-35"><span class="section-number-2">35</span> mourn</h2>
<div class="outline-text-2" id="text-35">
<p>
v (因丧失某人或某物)哀悼悲痛<br/>
mourn for/over sb/sth<br/>
</p>
<pre class="example">
He mourned for his dead child for many years.
</pre>
<p>
mourner 哀悼者（参加葬礼的亲朋）<br/>
</p>
</div>
</div>

<div id="outline-container-sec-36" class="outline-2">
<h2 id="sec-36"><span class="section-number-2">36</span> allegedly</h2>
<div class="outline-text-2" id="text-36">
<p>
allege<br/>
v state sth as a fact but without proof 声称<br/>
</p>
<pre class="example">
The prisoner alleged that he was at home on the night of the crime.
</pre>
<p>
alleged<br/>
adj 被控告的/据称的<br/>
</p>
<pre class="example">
the alleged conspirators（同谋）.
</pre>
<p>
allegedly<br/>
adv 据说地<br/>
</p>
<pre class="example">
He was allegedly a leading participant in the coup attempt.
</pre>
</div>
</div>

<div id="outline-container-sec-37" class="outline-2">
<h2 id="sec-37"><span class="section-number-2">37</span> sublease</h2>
<div class="outline-text-2" id="text-37">
<p>
lease<br/>
v rent租<br/>
n 租约<br/>
</p>
<pre class="example">
He leased the site to a local company.
</pre>
<p>
sublease=sublet转租<br/>
</p>
</div>
</div>

<div id="outline-container-sec-38" class="outline-2">
<h2 id="sec-38"><span class="section-number-2">38</span> almighty</h2>
<div class="outline-text-2" id="text-38">
<p>
=omnipotent万能的<br/>
</p>
</div>
</div>

<div id="outline-container-sec-39" class="outline-2">
<h2 id="sec-39"><span class="section-number-2">39</span> hot-button</h2>
<div class="outline-text-2" id="text-39">
<p>
政治敏感话题<br/>
</p>
</div>
</div>

<div id="outline-container-sec-40" class="outline-2">
<h2 id="sec-40"><span class="section-number-2">40</span> hothead</h2>
<div class="outline-text-2" id="text-40">
<p>
冲动的人<br/>
</p>
</div>
</div>

<div id="outline-container-sec-41" class="outline-2">
<h2 id="sec-41"><span class="section-number-2">41</span> splutter</h2>
<div class="outline-text-2" id="text-41">
<p>
v 咳呛声/气急败坏地说<br/>
</p>
<pre class="example">
"How dare you?" she spluttered.
</pre>
</div>
</div>

<div id="outline-container-sec-42" class="outline-2">
<h2 id="sec-42"><span class="section-number-2">42</span> What's the buzz?</h2>
<div class="outline-text-2" id="text-42">
<p>
最近的话题<br/>
</p>
</div>
</div>

<div id="outline-container-sec-43" class="outline-2">
<h2 id="sec-43"><span class="section-number-2">43</span> cease and desist</h2>
<div class="outline-text-2" id="text-43">
<p>
警告（正式地）<br/>
desist =cease =stop<br/>
</p>
</div>
</div>

<div id="outline-container-sec-44" class="outline-2">
<h2 id="sec-44"><span class="section-number-2">44</span> obnoxious</h2>
<div class="outline-text-2" id="text-44">
<p>
adj extremely unpleasant<br/>
</p>
</div>
</div>

<div id="outline-container-sec-45" class="outline-2">
<h2 id="sec-45"><span class="section-number-2">45</span> hooray</h2>
<div class="outline-text-2" id="text-45">
<p>
叫好声/万岁<br/>
</p>
</div>
</div>

<div id="outline-container-sec-46" class="outline-2">
<h2 id="sec-46"><span class="section-number-2">46</span> chore</h2>
<div class="outline-text-2" id="text-46">
<p>
unpleasant job<br/>
</p>
<pre class="example">
If you read your news from an NNTP server that's far away, the network latencies may make reading articles a chore.
</pre>
</div>
</div>

<div id="outline-container-sec-47" class="outline-2">
<h2 id="sec-47"><span class="section-number-2">47</span> credential</h2>
<div class="outline-text-2" id="text-47">
<p>
证书/凭据<br/>
certificate<br/>
</p>
</div>
</div>

<div id="outline-container-sec-48" class="outline-2">
<h2 id="sec-48"><span class="section-number-2">48</span> caveat</h2>
<div class="outline-text-2" id="text-48">
<p>
warning<br/>
</p>
</div>
</div>
</div>
</body>
</html>
